In [25]:
import pandas as pd
import numpy as np
import seaborn as sns

In [9]:
# 샘플 dict 생성
dict1 = {'Name': ['Choi', 'Hong', 'Kim'],
          'Korean': [60, 50, 75],
          'Math': [70, 85, 95]}

print(type(dict1))
dict1

<class 'dict'>

{'Name': ['Choi', 'Hong', 'Kim'], 'Korean': [60, 50, 75], 'Math': [70, 85, 95]}

In [10]:
# dict to DataFrame
df1 = pd.DataFrame(dict1)
print(type(df1))
df1

<class 'pandas.core.frame.DataFrame'>

   Name  Korean  Math
0  Choi      60    70
1  Hong      50    85
2   Kim      75    95

In [11]:
# DataFrame to dict
dict2 = df1.to_dict()
print(type(dict2))
print(dict2)

<class 'dict'>
{'Name': {0: 'Choi', 1: 'Hong', 2: 'Kim'}, 'Korean': {0: 60, 1: 50, 2: 75}, 'Math': {0: 70, 1: 85, 2: 95}}

In [24]:
# 샘플 dict 생성
dict1 = {'a' : 123, 'b' : 456, 'c' : 789}
print(type(dict1))
dict1

<class 'dict'>

{'a': 123, 'b': 456, 'c': 789}

In [17]:
# dict to list
list1 = list(dict1.keys())
list2 = list(dict1.values())
print(type(list2))
list2

<class 'list'>

[123, 456, 789]

In [23]:
# list to dict
dict2 = dict(zip(list1, list2))
print(type(dict2))
dict2

<class 'dict'>

{'a': 123, 'b': 456, 'c': 789}

In [37]:
# 샘플 DataFrame 생성
df1 = sns.load_dataset('tips').sample(5)
df1

     total_bill   tip     sex smoker   day    time  size
233       10.77  1.47    Male     No   Sat  Dinner     2
53         9.94  1.56    Male     No   Sun  Dinner     2
100       11.35  2.50  Female    Yes   Fri  Dinner     2
200       18.71  4.00    Male    Yes  Thur   Lunch     3
61        13.81  2.00    Male    Yes   Sat  Dinner     2

In [38]:
# DataFrame to Series : 열이 하나인 경우 자동으로 변환
sr1 = df1['total_bill']
print(type(sr1))
sr1.head()

<class 'pandas.core.series.Series'>

233    10.77
53      9.94
100    11.35
200    18.71
61     13.81
Name: total_bill, dtype: float64

In [40]:
# Series to DataFrame : 열이 복수인 경우 자동으로 변환
sr2 = df1['tip']
df2 = pd.concat([sr1, sr2], axis=1)
print(type(df2))
df2

<class 'pandas.core.frame.DataFrame'>

     total_bill   tip
233       10.77  1.47
53         9.94  1.56
100       11.35  2.50
200       18.71  4.00
61        13.81  2.00

In [42]:
# Series to list
list1 = sr1.to_list()
print(type(list1))
list1

<class 'list'>

[10.77, 9.94, 11.35, 18.71, 13.81]

In [43]:
# list to Series 
sr3 = pd.Series(list1)
print(type(sr3))
sr3

<class 'pandas.core.series.Series'>

0    10.77
1     9.94
2    11.35
3    18.71
4    13.81
dtype: float64

In [47]:
# Series to dict 변환 : index가 key로 됨
dict1 = sr2.to_dict()
print(type(dict1))
dict1

<class 'dict'>

{233: 1.47, 53: 1.56, 100: 2.5, 200: 4.0, 61: 2.0}

In [48]:
# dict to Series : 마찬가지로 key가 index로 됨
pd.Series(dict1)

233    1.47
53     1.56
100    2.50
200    4.00
61     2.00
dtype: float64

In [54]:
# list to tuple
tuple1 = tuple(list1)
print(type(tuple1))
tuple1

<class 'tuple'>

(10.77, 9.94, 11.35, 18.71, 13.81)

In [55]:
# tuple to list
list2 = list(tuple1)
print(type(list2))
list2

<class 'list'>

[10.77, 9.94, 11.35, 18.71, 13.81]

In [ ]:
# numpy랑 set도 추가하면 좋겠음